lab_meetings/lab_presentation_2/notes.tex
% Created 2020-03-31 Tue 16:45
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{UoB}
\author{Mark Blyth}
\date{}
\title{Speaker notes: numerical continuation in computational biology}
\hypersetup{
 pdfauthor={Mark Blyth},
 pdftitle={Speaker notes: numerical continuation in computational biology},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Chapter 1}
\label{sec:org714520e}

\begin{frame}[label={sec:orgfe9f2a2}]{1 TITLE PAGE}
\begin{itemize}
\item Been working on a review paper recently
\item Aims to introduce some mathematical ideas to a biological audience
\item This presentation follows the paper
\item If anything doesn't make sense, point it out and ask questions!
\end{itemize}

Review paper discusses bifurcations, their applications to biology, and the different software tools that are available for studying them.
\end{frame}

\begin{frame}[label={sec:org1b02e71}]{2 What is computational biology?}
\begin{itemize}
\item \emph{Goal: use maths to understand the mechanisms behind living processes}
\begin{itemize}
\item Biological processes have lots of interacting systems, which can be challenging to reason about qualitatively
\item Maths gives us a rigorous framework / toolbox / language for investigating these processes
\end{itemize}

\item \emph{Differential equations are used to explain lots of these processes}
\begin{itemize}
\item \emph{Hodgkin-Huxley: neural dynamics}
\begin{itemize}
\item Explains how ionic currents give rise to excitable behaviours in neurons
\end{itemize}

\item \emph{Lotka-Volterra: population dynamics}
\begin{itemize}
\item Describes how predators and prey compete
\end{itemize}

\item \emph{SIR model: epidemic dynamics}
\begin{itemize}
\item Descibes how rates of infection change during an epidemic
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga834507}]{3 Differential equations for biology}
\begin{block}{\emph{Ordinary differential equation}}
\emph{Description of how a system state changes in time}
\end{block}

\begin{block}{}
\begin{itemize}
\item They're the equations of motion of a state
\item Relate the current state value to how the state value is currently changing
\end{itemize}
\end{block}
\end{frame}


\begin{frame}[label={sec:org6e7f0a9}]{3 Differential equations for biology}
\begin{block}{\emph{System state}}
\emph{Minimal amount of information to describe something's behaviour}
\end{block}

\begin{block}{}
State at any one time contains all the information required to determine the state at any future time

\begin{itemize}
\item For neurons, it would be channel conductances, and membrane potential
\item For predator-prey, it's how many predators and how many prey there are
\item For epidemics it's the number of uninfected, infected, and cured people
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label={sec:org0b0a59d}]{3 Differential equations for biology}
\begin{block}{\emph{Nonlinear system}}
\emph{A set of ordinary differential equations, where the change in state doesn't follow a simple proportional relationship}
\end{block}

\begin{block}{}
\begin{itemize}
\item Linear systems: state changes proportional to its present value
\item Nonlinear systems: it doesn't
\item Adds a lot of extra complexity
\begin{itemize}
\item Generically we can't write down a solution to nonlinear ODEs
\end{itemize}
\item Upside: the extra complexity gives us extra richness: it lets us describe complex behaviours, and non-trivial phemomena
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label={sec:org42f6382}]{4 Drawing pictures}
\begin{itemize}
\item Phase plane diagrams let us draw pictures of differential equations
\item This neuron model has state vars (x,y), so we can represent a state as a point on a plane
\item As the states evolve under equations of motion, it moves around the plane
\item Arrows show which way the state moves, from any given point
\item We can track states, and draw the paths they follow as they move, giving lines
\item These lines are called trajectories
\item The red circle is a periodic trajectory -- it loops round and round constantly
\item The blue dot is an equilibrium; if we start there, we'll stay there forever
\item We call the way the states change, the `dynamics' of the system
\item The other lines are nullclines, which we don't have to worry about here
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org97c9416}]{5 The role of parameters}
\emph{Every equation has parameters:}
(If we treat coefficients as parameters,) it's impossible to write an equation without them.
\begin{itemize}
\item \emph{Some of these are fixed}
\begin{itemize}
\item Can't change how hungry a wolf is, in population dynamics
\item Can't change how population size in an epidemic model
\end{itemize}
\item \emph{Some of these we can play with}
\begin{itemize}
\item Can change how many wolves we have in a population
\item Can change the transfer rate in epidemic modelling (social distancing!)
\end{itemize}
\end{itemize}

\emph{The exact behaviours of a system necessarily depend on these parameters}

Sensible question: what happens if we change them?
\end{frame}

\begin{frame}[label={sec:org9081dfc}]{6 Bifurcations}
Bifurcation theory studies how system dynamics change as we vary parameters.

\begin{itemize}
\item A change in the dynamics could be a fixed point appearing, in which case the system now settles down to a rest state
\item It could also be a limit cycle appearing, perhaps meaning the system jumps from a rest state to an active limit cycle state
\item Generally, bifurcations concern the appearance and disappearance of these features
\item We also get things like period-doubling bifurcations, where a periodic orbit halves in speed, so that's not always the case
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org94255c3}]{7 Biological bifurcations}
So, what is the significance of bifurcations in computational biology?

Epigenetics gives us a nice example

\begin{itemize}
\item \emph{Waddington describes cell specialisation like marbles rolling down a valley}
\begin{itemize}
\item The marbles roll along, staying in the bottom of the valley, in the same way as cells remain in a specific specialisation state
\end{itemize}

\item \emph{When the valley splits, two cell fates emerge}
\begin{itemize}
\item The marbles can either roll left or right, depending on where any external influences push it
\item We now have two stable cell fates, instead of one, which we call bistability
\item The system has changed from monostable to bistable
\item This change is a bifurcation
\end{itemize}

\item \emph{This is a nice example of a bifurcation!}
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org1a187cb}]{8 Biological bifurcations}
\begin{itemize}
\item We can describe this more mathematically using a bifurcation diagram
\item \(x\) axis shows the degree of specialisation, \(y\) axis shows cell fates
\item Initially we have one cell fate, shown by the black line
\item As specialisation increases, the cell fate branches into three
\item One of these is unstable -- this is like the cell rolling along the top of the ridge between the two valleys; it could theoretically do that, but even the smallest nudge in either direction would sent it off away from this fate, and down to one of the stable ones
\item We call this an unstable equilibrium, and denote it with a dashed line
\item This corresponds to a pitchfork bifurcation
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgdbf6a08}]{9 The role of bifurcation analysis in biology}
So, why should biologists care about bifurcations?   

\begin{itemize}
\item \emph{Bifurcations can explain seisures, heart attacks, Parkinson's, and many other diseases!}
\begin{itemize}
\item Dynamical diseases: pathological behaviours can arise from unwanted changes in the body's dynamics
\item If we can understand the bifurcations that cause these diseases, we can reason about how to prevent or cure them

\vfill
\end{itemize}
\end{itemize}
CONTINUED 
\end{frame}
\begin{frame}[label={sec:org733f0f7}]{9 The role of bifurcation analysis in biology}
\begin{itemize}
\item \emph{Bifurcations can be used to explain the functionality of biological systems}
\begin{itemize}
\item Most results from classical neuroscience can be explained in terms of just four bifurcations
\item This means we can also predict new cell behaviours; there's several cases where bifurcations have predicted cell behaviours that have later turned up in experiments

\vfill
\end{itemize}
\end{itemize}
CONTINUED 
\end{frame}
\begin{frame}[label={sec:org830f158}]{9 The role of bifurcation analysis in biology}
\begin{itemize}
\item \emph{Bifurcations can be used to design biological systems}
\begin{itemize}
\item Artificial cell oscillators have been designed, exploiting the bifurcations present in cell signalling pathways
\item The regions in which oscillations occur are found by searching for Hopf bifurcations
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org35936a6}]{10 Methods for bifurcation analysis}
\begin{itemize}
\item \emph{Analytic calculations}
\begin{itemize}
\item Work out with a pen and paper when a bifurcation occurs
\item Most rigorous method, but also exceedingly difficult even for comparatively simple systems
\end{itemize}
\item \emph{Brute force computation}
\begin{itemize}
\item Simulate the system for lots of different parameter values, and see what happens
\item We risk missing subtle details
\item It works for simple systems with small numbers of parameters, but when we have high-dimensional states, or lots of parameters to play with, it stops being useful

\vfill
\end{itemize}
\end{itemize}
CONTINUED 
\end{frame}

\begin{frame}[label={sec:org43896bf}]{10 Methods for bifurcation analysis}
\begin{itemize}
\item \emph{Numerical continuation}
\begin{itemize}
\item This is a rigorous approach to finding bifurcations
\item It's done on a computer, so it's easier than analytic computations, but more rigorous than brute force
\item There's lots of different software for analysing bifurcations, and they all use numerical continuation to do that
\item It's the go-to method!
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5bc2c7c}]{11 Numerical continuation}
\begin{itemize}
\item \emph{We use numerical continuation to track `interesting' points}
\begin{itemize}
\item Interesting points can be equilibria, bifurcation points, or even periodic orbits
\item \emph{We vary a parameter}
\item \emph{Continuation tells us how the point changes}
\item Continuation lets us track thees interesting points as the parameter changes; formally, we say it traces out implicitly defined manifolds -- points, lines, planes at which interesting behaviours happen
\end{itemize}
\item \emph{Test functions indentify bifurcations}
\begin{itemize}
\item These are functions whose zero occur only when we have a bifurcation
\end{itemize}
\item Together, the tracking and testing setup lets us find bifurcations algorithmically
\end{itemize}
\end{frame}


\section{Chapter 2}
\label{sec:orgaacdb9a}
\begin{frame}[label={sec:org442d74e}]{12 Bifurcation analysis of a bursting neuron}
\begin{itemize}
\item Neurons encode their information in spikes
\item They don't always spike consistently; sometimes they alternate between a period of spiking and a period of resting
\item The displayed plot, taken from wikipedia, shows a simulation of a bursting neuron
\item Their dynamics appear as a result of having a rich bifurcation structure, so they're interesting to use for a bifurcation analysis
\item Here I'm going to demonstrate how we could do such a bifurcation analysis
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org372215b}]{13 The Hindmarsh Rose model}
\begin{itemize}
\item The plot shown previously was made by simulating the Hindmarsh Rose model, which gives a phenomenological model [EXPLAIN] for bursting neurons. We'll use that model here for the bifurcation analysis.
\item The key thing to note is that \(r\) is very small
\begin{itemize}
\item As \(z\) changes much more slowly than \(x\) and \(y\), we can pretend it's a constant
\item We then do a bifurcation analysis, using \(z\) as a parameter
\item When we stop pretending \(z\) is constant, it will drive \(x,y\) -- the fast subsystem -- across the bifurcations we found earlier
\end{itemize}
\item We therefore use numerical continuation to find bifurcations in the \(x,y\) equations, when \(z\) is taken as a parameter
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org27d5b72}]{14 Exploratory step}
\begin{itemize}
\item We start by simply simulating the \(x,y\) system for default parameter values
\item This gives us some idea of what to expect and where to start the analysis
\item We can see an attracting limit cycle
\item Since its in a plane, it must have a repelling equilibrium in the center
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb6f45b5}]{15 Initialisation step}
\begin{itemize}
\item This is the same diagram we saw earlier
\item The equilibrium in the center is a good place to start a continuation from (it's generally hard to start at a periodic orbit), so here all we're doing is finding exactly where that equilibrium is
\item Now it's found, we can start looking for bifurcations
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org23a6d7d}]{16 Equilibrium point curve}
\begin{itemize}
\item We now take \(z\) as a parameter, and sweep it across a range of values
\item We use numerical continuation to track how the equilibrium changes, as we vary \(z\)
\item The plot shows the \(x\) position of the equilibrium, as a function of \(z\)
\item The curve doubles back on itself twice. We call these points `fold' points, and they're actually a type of bifurcation
\item The test functions have spotted another two bifurcations along the equilibrium point curve; these are Hopf points
\item Periodic orbits appear at a Hopf bifurcation, so the next step is to track these
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org522a77c}]{17 Periodic orbit continuation}
\begin{itemize}
\item The purple lines show the maximum and minimum of the periodic orbits
\item If we were to look at the \(x,y\) plane, we would see a limit cycle here, much like the one we saw earlier
\item These limit cycles provide the spiking behaviour of the neuron
\item The equilibria give a resting state, where the neuron sits around doing nothing
\item When these coexist, the neuron is able to either spike or sit silently, depending on other influences
\item This actually gives us most of what we need to understand bursting behaviour
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org24a174d}]{18 Full system dynamics}
\begin{itemize}
\item Here I've zoomed in on the area of parameter space where bursting occurs
\item I've simulated the full system, including the \(z\) equation, and overlayed a trajectory onto the diagram
\item This shows where the bursting behavior comes from
\item A resting state disappears through a fold bifurcation, causing the system to jump onto the spiking limit cycles
\item These limit cycles in turn disappear through a homoclinic bifurcation, making the system jump back to the resting state
\item The slow variable \(z\) drives the fast subsystem back and forth across these two bifurcations, so the spikes periodically switch on and off, giving bursting.
\end{itemize}
\end{frame}

\section{Chapter 3}
\label{sec:orgb498ca4}
\begin{frame}[label={sec:org4861b79}]{19 Software tools}
\emph{There's lots of software to do these sorts of calculations!}
\begin{itemize}
\item The paper has comparison tables in, and provides recommendations of which software to use when
\item It's not a particularly exciting thing to put into a presentation, so I'm not going into any real detail about it
\item The main takeaway is that there's good tools to do these calculations, some of which are powerful but hard to use, and others which are easy to use but less sophisticated.
\end{itemize}
\end{frame}
\end{document}
